Repository: czhovo/chekinana
Catalog: ios/Chekinana/Chekinana/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hant

# assistant.prompt.scan_result
source: Choose the scan results to save.
ja: 保存するスキャン結果を選択してください。
zh_hans: 请选择要保存的扫描结果。
zh_hant: 請選擇要儲存的掃描結果。

# assistant.recognize_date
source: Recognize handwritten dates
ja: 手書き日付を認識
zh_hans: 识别手写日期
zh_hant: 辨識手寫日期

# assistant.recognize_date_detail
source: Requests dates and bounding boxes; boxes are shown only in previews.
ja: 日付と境界枠を取得し、枠はプレビューにのみ表示します。
zh_hans: 请求日期和边界框，框仅显示在预览中。
zh_hant: 取得日期和邊界框；邊界框僅顯示於預覽中。

# assistant.recognize_date_hint
source: Does not modify or save images with boxes
ja: 枠付き画像を変更または保存しません
zh_hans: 不会修改或保存带框图片
zh_hant: 不會修改或儲存帶框圖片

# assistant.recognize_idol
source: Recognize Idols
ja: アイドルを認識
zh_hans: 识别偶像
zh_hant: 辨識偶像

# assistant.recognize_idol_detail
source: Uses the on-device encoder to compare existing Idol patterns.
ja: 端末内エンコーダーで既存のアイドルパターンと比較します。
zh_hans: 使用本机编码器与已有偶像模式比对。
zh_hant: 使用裝置內的編碼器，與現有的偶像模式比對。

# assistant.recognize_idol_hint
source: Uses all valid local patterns and the Unassigned candidate
ja: 有効なローカルパターンと未割り当て候補を使用します
zh_hans: 使用所有有效本地模式和未分配候选
zh_hant: 使用所有有效的本機模式及未分配候選項目

# assistant.record.confirmation
source: Prepared %@ operation. Confirm to continue.
ja: %@の操作を準備しました。続行するには確認してください。
zh_hans: 已准备%@操作，请确认后继续。
zh_hant: 已準備%@操作，請確認後繼續。

# assistant.record.none
source: No matching records.
ja: 一致する記録はありません。
zh_hans: 没有匹配的记录。
zh_hant: 沒有符合的記錄。

# assistant.record.saved
source: Record operation completed.
ja: 記録の操作が完了しました。
zh_hans: 记录操作已完成。
zh_hant: 記錄操作已完成。

# assistant.redacted_input
source: [Input containing credentials hidden]
ja: [認証情報を含む入力を非表示]
zh_hans: [已隐藏包含凭据的输入]
zh_hant: [已隱藏包含憑證的輸入]

# assistant.redacted_url
source: [URL containing credentials hidden]
ja: [認証情報を含むURLを非表示]
zh_hans: [已隐藏包含凭据的 URL]
zh_hant: [已隱藏包含憑證的連結]

# assistant.retry_hint
source: Send the preserved request again
ja: 保持されたリクエストをもう一度送信します
zh_hans: 重新发送已保留的请求
zh_hant: 重新傳送已保留的請求

# assistant.retry.cancelled
source: Retry was cancelled. Your input remains in the composer.
ja: 再試行をキャンセルしました。入力は入力欄に保持されています。
zh_hans: 已取消重试，原输入仍保留在输入框中。
zh_hant: 已取消重試，原輸入仍保留於輸入欄中。

# assistant.save
source: Save
ja: 保存
zh_hans: 保存
zh_hant: 儲存

# assistant.save_original
source: Save original
ja: 元画像を保存
zh_hans: 保存原图
zh_hant: 儲存原圖

# assistant.save_original_hint
source: Save the clean image without the date bounding box
ja: 日付の検出枠を描画せず元画像を保存します
zh_hans: 保存未绘制日期检测框的原图
zh_hant: 儲存未繪製日期偵測框的原圖

# assistant.scan_all
source: Add details to all Cheki
ja: すべてのチェキに情報を追加
zh_hans: 为全部拍立得补充信息
zh_hant: 為所有拍立得補充資訊

# assistant.scan_result_index
source: Scan result %lld
ja: スキャン結果%lld
zh_hans: 扫描结果%lld
zh_hant: 掃描結果 %lld

# assistant.scan.edit_help
source: Edit each result’s Idol, date, Event, and other details. You can also delete a result or save its original image.
ja: 各結果のアイドル、日付、イベントなどを編集できます。削除や元画像の保存もできます。
zh_hans: 可逐张编辑偶像、日期、活动等信息，也可删除或保存原图。
zh_hant: 可逐張編輯偶像、日期、活動等資訊，也可刪除或儲存原圖。

# assistant.scan.recognized
source: Recognized %lld Cheki.
ja: チェキを%lld枚認識しました。
zh_hans: 已识别%lld张切。
zh_hant: 已辨識 %lld 張切。

# assistant.scan.recognized.one
source: Recognized %lld Cheki.
ja: チェキを%lld枚認識しました。
zh_hans: 已识别%lld张切。
zh_hant: 已辨識 %lld 張切。

# assistant.scan.recognized.other
source: Recognized %lld Cheki.
ja: チェキを%lld枚認識しました。
zh_hans: 已识别%lld张切。
zh_hant: 已辨識 %lld 張切。

# assistant.scan.unsaved
source: These results are not saved yet. Each needs a date before confirmation.
ja: これらの結果は未保存です。確認前に各結果へ日付を設定してください。
zh_hans: 这些结果尚未保存；每张确认前都需要日期。
zh_hant: 這些結果尚未儲存；確認前須為每張設定日期。

# assistant.scan.warnings
source: The scan produced %lld warnings.
ja: スキャンで警告が%lld件ありました。
zh_hans: 扫描产生%lld条提醒。
zh_hant: 掃描產生 %lld 則提醒。

# assistant.scan.warnings.one
source: The scan produced %lld warning, such as a count mismatch or an earlier unused result being released.
ja: スキャンで警告が%lld件ありました。件数の不一致や以前の未使用結果の解放などです。
zh_hans: 扫描产生%lld条提醒，例如数量不一致或较早的未使用结果被释放。
zh_hant: 掃描產生 %lld 則提醒，例如數量不符或較早未使用的結果已釋放。

# assistant.scan.warnings.other
source: The scan produced %lld warnings, such as a count mismatch or an earlier unused result being released.
ja: スキャンで警告が%lld件ありました。件数の不一致や以前の未使用結果の解放などです。
zh_hans: 扫描产生%lld条提醒，例如数量不一致或较早的未使用结果被释放。
zh_hant: 掃描產生 %lld 則提醒，例如數量不符或較早未使用的結果已釋放。

# assistant.scanner.invalid_configuration
source: The scanner service address is invalid. No photos were read and no request was sent.
ja: スキャナーサービスのアドレスが無効です。写真は読み込まれず、リクエストも送信されていません。
zh_hans: 扫描服务地址无效；未读取照片，也未发送请求。
zh_hant: 掃描服務的位址無效；未讀取照片，也未傳送請求。

# assistant.scanner.invalid_plan
source: The scan request failed local safety validation. No photos were read and no request was sent.
ja: スキャン要求がローカル安全検証に失敗しました。写真は読み込まれず、リクエストも送信されていません。
zh_hans: 扫描请求未通过本地安全校验；未读取照片，也未发送请求。
zh_hant: 掃描請求未通過本機安全驗證；未讀取照片，也未傳送請求。

# assistant.send
source: Send
ja: 送信
zh_hans: 发送
zh_hant: 傳送

# assistant.send_hint
source: Send this message to Chekinana
ja: このメッセージをChekinanaに送信します
zh_hans: 将这条消息发送给 Chekinana
zh_hant: 將這則訊息傳送給 Chekinana

# assistant.size.mini
source: Mini
ja: ミニ
zh_hans: 迷你
zh_hant: 迷你

# assistant.size.wide
source: Wide
ja: ワイド
zh_hans: 宽幅
zh_hant: 寬幅

# assistant.temporary.date_section
source: Date (required before confirmation)
ja: 日付（確認前に必須）
zh_hans: 日期（确认前必填）
zh_hant: 日期（確認前必填）

# assistant.temporary.delete_failed
source: This temporary Cheki could not be deleted. Cancel its confirmation first if needed.
ja: この一時チェキを削除できませんでした。必要な場合は先に確認をキャンセルしてください。
zh_hans: 无法删除这张临时拍立得；如已进入待确认状态，请先取消确认。
zh_hant: 無法刪除這張暫存拍立得；如已進入待確認狀態，請先取消確認。

# assistant.temporary.deleted
source: The temporary Cheki was deleted without changing the database or image storage.
ja: データベースや画像ストレージを変更せず、一時チェキを削除しました。
zh_hans: 已删除临时拍立得，未写入数据库或图片存储。
zh_hant: 已刪除暫存拍立得，未變更資料庫或圖片儲存空間。

# assistant.temporary.edit_title
source: Edit Temporary Cheki
ja: 一時チェキを編集
zh_hans: 编辑临时拍立得
zh_hant: 編輯暫存拍立得

# assistant.temporary.event
source: Event (optional; does not affect index)
ja: イベント（任意、番号には影響しません）
zh_hans: 活动（可选，不参与编号）
zh_hant: 活動（選填，不影響編號）

# assistant.temporary.favorite
source: Favorite
ja: お気に入り
zh_hans: 收藏
zh_hant: 收藏

# assistant.temporary.idols
source: Idols (optional, multiple allowed)
ja: アイドル（任意、複数選択可）
zh_hans: 偶像（可多选或留空）
zh_hant: 偶像（可複選或留空）

# assistant.temporary.index_conflict
source: Index #%lld is already used by this Idol/date group.
ja: このアイドル・日付グループでは番号#%lldが既に使用されています。
zh_hans: 该偶像/日期组已使用编号#%lld。
zh_hant: 此偶像／日期群組已使用編號 #%lld。

# assistant.temporary.index_requires_group
source: A positive index requires a date and at least one Idol.
ja: 正の番号には日付と1人以上のアイドルが必要です。
zh_hans: 正整数编号需要日期和至少一个偶像。
zh_hant: 正整數編號需要日期及至少一位偶像。

# assistant.temporary.invalid
source: This temporary Cheki is no longer available.
ja: この一時チェキは利用できません。
zh_hans: 这张临时拍立得已失效或已被处理。
zh_hant: 這張暫存拍立得已失效或已處理。

# assistant.temporary.invalid_date
source: The selected date could not be read. Choose it again.
ja: 選択した日付を読み取れませんでした。もう一度選択してください。
zh_hans: 无法读取所选日期，请重新选择。
zh_hant: 無法讀取所選日期，請重新選擇。

# assistant.temporary.invalid_index
source: The index must be empty or a positive integer.
ja: 番号は空欄または正の整数にしてください。
zh_hans: 编号必须留空或填写正整数。
zh_hant: 編號必須留空或填寫正整數。

# assistant.temporary.other
source: Other details
ja: その他の情報
zh_hans: 其他属性
zh_hant: 其他資訊

# assistant.temporary.posted
source: Posted to SNS
ja: SNSに投稿済み
zh_hans: 已发布到 SNS
zh_hant: 已發佈至社群平台

# assistant.temporary.set_date
source: Set date
ja: 日付を設定
zh_hans: 设置日期
zh_hant: 設定日期

# assistant.temporary.size
source: Size
ja: サイズ
zh_hans: 尺寸
zh_hant: 尺寸

# assistant.temporary.update_failed
source: This temporary Cheki could not be updated; it may have expired.
ja: この一時チェキを更新できませんでした。有効期限切れの可能性があります。
zh_hans: 无法更新这张临时拍立得；它可能已过期。
zh_hant: 無法更新這張暫存拍立得；它可能已過期。

# assistant.temporary.update_unavailable
source: This temporary Cheki could not be updated; it may have expired or entered confirmation.
ja: この一時チェキを更新できませんでした。有効期限切れか確認待ちの可能性があります。
zh_hans: 无法更新这张临时拍立得；它可能已过期或进入待确认状态。
zh_hant: 無法更新這張暫存拍立得；它可能已過期或進入待確認狀態。

# assistant.transcript
source: Transcript
ja: 会話履歴
zh_hans: 对话记录
zh_hant: 對話記錄

# assistant.use_all
source: All scan results
ja: すべてのスキャン結果
zh_hans: 全部扫描结果
zh_hant: 所有掃描結果

# assistant.use_date
source: Use date
ja: 日付を使用
zh_hans: 使用日期
zh_hant: 使用日期

# assistant.use_selected
source: Use selected
ja: 選択項目を使用
zh_hans: 使用所选
zh_hant: 使用所選項目

# assistant.use_this_date
source: Use this date
ja: この日付を使用
zh_hans: 使用这个日期
zh_hant: 使用此日期

source: Avatar for %@
ja: %@のアバター
zh_hans: %@的头像
zh_hant: %@的頭像

source: Back
ja: 戻る
zh_hans: 返回
zh_hant: 返回

source: Backend is unavailable from this device. You can retry immediately.
ja: この端末からバックエンドに接続できません。すぐに再試行できます。
zh_hans: 此设备无法连接后端。可以立即重试。
zh_hant: 此裝置無法連接後端。可以立即重試。

source: Backend startup connection was interrupted. You can retry immediately.
ja: バックエンド起動時の接続が切れました。すぐに再試行できます。
zh_hans: 后端启动连接已中断。可以立即重试。
zh_hant: 後端啟動連線已中斷。可以立即重試。

source: Bio
ja: プロフィール
zh_hans: 简介
zh_hant: 簡介

source: Birthday
ja: 誕生日
zh_hans: 生日
zh_hant: 生日

source: Camera and Photos are temporarily unavailable. Import Cheki remains available.
ja: カメラと写真は一時的に利用できません。チェキのインポートは引き続き利用できます。
zh_hans: 相机和照片暂时不可用，仍可导入拍立得。
zh_hant: 暫時無法使用相機和照片，仍可匯入拍立得。

source: Camera and Photos require GPU Ready. Import Cheki remains available.
ja: カメラと写真にはGPUの準備完了が必要です。チェキのインポートは引き続き利用できます。
zh_hans: 相机和照片需要 GPU 就绪，仍可导入拍立得。
zh_hant: 相機和照片需要 GPU 就緒，仍可匯入拍立得。

source: Cancel
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

# cancel 需要八位确认码或 all
source: cancel requires an eight-character confirmation code or all.
ja: cancelには8文字の確認コードまたはallが必要です。
zh_hans: cancel 需要八位确认码或 all。
zh_hant: cancel 需要八位確認碼或 all。

source: Candidate range
ja: 候補範囲
zh_hans: 候选范围
zh_hant: 候選範圍

source: Candidates
ja: 候補
zh_hans: 候选项
zh_hant: 候選項目

source: Capturing full-resolution photo…
ja: フル解像度の写真を撮影中…
zh_hans: 正在拍摄全分辨率照片…
zh_hant: 正在拍攝完整解析度照片…

source: Catalogue
ja: カタログ
zh_hans: 资料库
zh_hant: 資料庫

source: Catalogue avatar could not be prepared. Tap this result to retry: %@
ja: カタログのアバターを準備できませんでした。この結果をタップして再試行してください：%@
zh_hans: 无法准备资料库头像。请点按此结果重试：%@
zh_hant: 無法準備資料庫頭像。請點一下此結果以重試：%@

source: Cheki count
ja: チェキ枚数
zh_hans: 拍立得数量
zh_hant: 拍立得數量

source: Cheki deletion recovery is incomplete. Retry recovery before changing the library.
ja: チェキ削除の復旧が未完了です。ライブラリを変更する前に復旧を再試行してください。
zh_hans: 拍立得删除恢复尚未完成。更改资料库前请重试恢复。
zh_hant: 拍立得刪除復原尚未完成。變更資料庫前請重試復原。

source: Cheki media recovery is incomplete. Retry recovery before editing or replacing the library.
ja: チェキのメディア復旧が未完了です。編集またはライブラリの置き換えの前に復旧を再試行してください。
zh_hans: 拍立得媒体恢复尚未完成。编辑或替换资料库前请重试恢复。
zh_hant: 拍立得媒體復原尚未完成。編輯或取代資料庫前請重試復原。

source: Cheki size and orientation recognition are currently disabled. The default size is mini.
ja: チェキのサイズと向きの認識は現在無効です。既定のサイズはミニです。
zh_hans: 当前已禁用拍立得尺寸和方向识别。默认尺寸为迷你。
zh_hant: 目前已停用拍立得尺寸和方向辨識。預設尺寸為迷你。

source: Chekinana screen marker
ja: Chekinana画面マーカー
zh_hans: Chekinana 屏幕标记
zh_hant: Chekinana 畫面標記

source: Choose reference photo
ja: 参照写真を選択
zh_hans: 选择参考照片
zh_hant: 選擇參考照片

source: Clean up the staged or previous avatar before closing
ja: 閉じる前に準備済みまたは以前のアバターをクリーンアップしてください
zh_hans: 关闭前请清理暂存头像或旧头像
zh_hant: 關閉前請清理暫存或舊有的頭像

source: Clear
ja: 消去
zh_hans: 清除
zh_hant: 清除

source: Clear date
ja: 日付を消去
zh_hans: 清除日期
zh_hant: 清除日期

source: Clear search
ja: 検索を消去
zh_hans: 清除搜索
zh_hant: 清除搜尋

source: Close
ja: 閉じる
zh_hans: 关闭
zh_hant: 關閉

source: Close %@ detail
ja: %@の詳細を閉じる
zh_hans: 关闭%@详情
zh_hant: 關閉%@的詳細資訊

source: Close the local scanner manually on the Windows computer.
ja: Windowsコンピューターでローカルスキャナーを手動で終了してください。
zh_hans: 请在 Windows 电脑上手动关闭本地扫描服务。
zh_hant: 請在 Windows 電腦上手動關閉本機掃描服務。

source: Close without saving
ja: 保存せずに閉じる
zh_hans: 不保存并关闭
zh_hant: 不儲存並關閉

source: Color
ja: カラー
zh_hans: 颜色
zh_hant: 顏色

# common.retry
source: Retry
ja: 再試行
zh_hans: 重试
zh_hant: 重試

# confirm 只接受一个可选的八位确认码
source: confirm accepts only one optional eight-character confirmation code.
ja: confirmが受け付けるのは任意の8文字の確認コード1つだけです。
zh_hans: confirm 只接受一个可选的八位确认码。
zh_hant: confirm 只接受一個選填的八位確認碼。

source: Create new Cheki
ja: 新しいチェキを作成
zh_hans: 新建拍立得
zh_hant: 建立拍立得

source: creating an Event requires confirmation
ja: イベントの作成には確認が必要です
zh_hans: 创建活动需要确认
zh_hant: 建立活動需要確認

source: Current index: %@
ja: 現在の番号：%@
zh_hans: 当前编号：%@
zh_hant: 目前編號：%@

source: Database changes remain unsaved and the staged avatar still needs cleanup. Retry after the current file operation finishes.
ja: データベースへの変更は未保存で、準備済みアバターの削除も必要です。現在のファイル操作が完了してから再試行してください。
zh_hans: 数据库更改尚未保存，暂存头像仍需清理。请等待当前文件操作完成后重试。
zh_hant: 資料庫變更尚未儲存，暫存頭像仍需清理。請等待目前的檔案操作完成後重試。

# datastore.recovery.message
source: Your saved data was not cleared or replaced. Retry opening the same library.
ja: 保存済みデータは消去も置換もされていません。同じライブラリをもう一度開いてください。
zh_hans: 已保存的数据未被清除或替换。请重试打开同一个资料库。
zh_hant: 已儲存的資料未被清除或取代。請嘗試重新開啟同一個資料庫。

# datastore.recovery.title
source: Your library could not be opened
ja: ライブラリを開けませんでした
zh_hans: 无法打开资料库
zh_hant: 無法開啟資料庫

source: Date
ja: 日付
zh_hans: 日期
zh_hant: 日期

source: Date range
ja: 日付範囲
zh_hans: 日期范围
zh_hant: 日期範圍

# date.outside_supported_range
source: Choose a date from December 8, 2005 through December 31, 2200.
ja: 2005年12月8日から2200年12月31日までの日付を選択してください。
zh_hans: 请选择2005年12月8日至2200年12月31日之间的日期。
zh_hant: 請選擇 2005 年 12 月 8 日至 2200 年 12 月 31 日之間的日期。

source: Delete
ja: 削除
zh_hans: 删除
zh_hant: 刪除

source: Delete captured photo
ja: 撮影した写真を削除
zh_hans: 删除拍摄的照片
zh_hant: 刪除拍攝的照片

source: Delete temporary Cheki
ja: 一時チェキを削除
zh_hans: 删除临时拍立得
zh_hant: 刪除暫存拍立得

source: Deletes the latest remaining camera source and all Cheki extracted from it
ja: 最後に残ったカメラ画像と、そこから抽出したすべてのチェキを削除します
zh_hans: 删除最后一张相机原图及从中提取的所有拍立得
zh_hant: 刪除最後一張相機原圖及從中擷取的所有拍立得

source: Deletion recovery is required. Tap Delete again to finish restoring or cleaning up the managed image before closing.
ja: 削除の復旧が必要です。閉じる前にもう一度「削除」をタップし、管理対象画像の復元またはクリーンアップを完了してください。
zh_hans: 需要恢复删除操作。关闭前请再次点按“删除”，以完成托管图片的恢复或清理。
zh_hant: 需要復原刪除操作。關閉前請再次點一下「刪除」，完成受管理圖片的復原或清理。

source: Destination
ja: 保存先
zh_hans: 目标位置
zh_hant: 目標位置

source: Discard
ja: 破棄
zh_hans: 丢弃
zh_hant: 捨棄

source: Discard review
ja: 確認結果を破棄
zh_hans: 放弃检查
zh_hant: 捨棄檢查結果

source: Discard unsaved results?
ja: 未保存の結果を破棄しますか？
zh_hans: 放弃未保存的结果？
zh_hant: 捨棄未儲存的結果？

source: Done
ja: 完了
zh_hans: 完成
zh_hant: 完成

source: duplicate argument: %@
ja: 引数が重複しています：%@
zh_hans: 参数重复：%@
zh_hant: 參數重複：%@

source: Edit
ja: 編集
zh_hans: 编辑
zh_hant: 編輯

source: Edit %@
ja: %@を編集
zh_hans: 编辑%@
zh_hant: 編輯%@

source: Edit Idol
ja: アイドルを編集
zh_hans: 编辑偶像
zh_hant: 編輯偶像

source: Edit temporary Cheki
ja: 一時チェキを編集
zh_hans: 编辑临时拍立得
zh_hant: 編輯暫存拍立得

# editcheki 需要目标和有效字段
source: editcheki requires a target and valid fields.
ja: editchekiには対象と有効なフィールドが必要です。
zh_hans: editcheki 需要目标和有效字段。
zh_hant: editcheki 需要目標和有效欄位。

# editevent 需要目标和 name/date/url 字段
source: editevent requires a target and name/date/url fields.
ja: editeventには対象とname/date/urlのフィールドが必要です。
zh_hans: editevent 需要目标和 name/date/url 字段。
zh_hant: editevent 需要目標和 name/date/url 欄位。

# editidol 不支持字段
source: editidol does not support this field.
ja: editidolはこのフィールドに対応していません。
zh_hans: editidol 不支持此字段。
zh_hant: editidol 不支援此欄位。

# editidol 需要目标和至少一个 field=value
source: editidol requires a target and at least one field=value.
ja: editidolには対象と、少なくとも1つのfield=valueが必要です。
zh_hans: editidol 需要目标和至少一个 field=value。
zh_hant: editidol 需要目標和至少一個 field=value。

source: empty command
ja: コマンドが空です
zh_hans: 命令为空
zh_hant: 指令為空

source: Event
ja: イベント
zh_hans: 活动
zh_hant: 活動

# Event URL 不能包含用户名或密码
source: An Event URL must not contain a username or password.
ja: イベントURLにユーザー名やパスワードを含めることはできません。
zh_hans: 活动 URL 不能包含用户名或密码。
zh_hant: 活動 URL 不可包含使用者名稱或密碼。

# Existing%@ · %@
source: Existing%1$@ · %2$@
ja: 既存%1$@ · %2$@
zh_hans: 已有%1$@ · %2$@
zh_hant: 現有%1$@ · %2$@

source: Export
ja: 書き出す
zh_hans: 导出
zh_hant: 匯出

source: Favorite
ja: お気に入り
zh_hans: 收藏
zh_hant: 收藏

source: Favorite status could not be saved: %@
ja: お気に入りの状態を保存できませんでした：%@
zh_hans: 无法保存收藏状态：%@
zh_hant: 無法儲存收藏狀態：%@

source: fields: name, group, birthday, color, verification, bio, avatar (avatar_url is accepted as an alias)
ja: フィールド：name、group、birthday、color、verification、bio、avatar（avatar_urlも別名として使用可能）
zh_hans: 字段：name、group、birthday、color、verification、bio、avatar（也接受别名 avatar_url）
zh_hant: 欄位：name、group、birthday、color、verification、bio、avatar（也接受別名 avatar_url）

source: fields: name, group, birthday, color, verification, bio, avatar; use - to clear optional fields
ja: フィールド：name、group、birthday、color、verification、bio、avatar。任意フィールドを消去するには - を使用します
zh_hans: 字段：name、group、birthday、color、verification、bio、avatar；使用 - 清空可选字段
zh_hant: 欄位：name、group、birthday、color、verification、bio、avatar；使用 - 清空選填欄位

source: Fixed date
ja: 日付を固定
zh_hans: 固定日期
zh_hant: 固定日期

source: GPU management is temporarily paused. Import Cheki remains available.
ja: GPU管理は一時停止中です。チェキのインポートは引き続き利用できます。
zh_hans: GPU 管理已暂时暂停，仍可导入拍立得。
zh_hant: GPU 管理已暫時暫停，仍可匯入拍立得。

source: GPU management paused
ja: GPU管理を一時停止しました
zh_hans: GPU 管理已暂停
zh_hant: GPU 管理已暫停

source: GPU out of capacity, try later
ja: GPUの空きがありません。後でもう一度お試しください。
zh_hans: GPU 容量不足，请稍后重试
zh_hant: GPU 容量不足，請稍後重試

source: GPU startup was canceled. Refresh status before trying again.
ja: GPUの起動をキャンセルしました。状態を更新してから再試行してください。
zh_hans: GPU 启动已取消。请刷新状态后再试。
zh_hant: GPU 啟動已取消。請重新整理狀態後再試。

source: Group
ja: グループ
zh_hans: 组合
zh_hant: 團體

source: Hello! I’m Chekinana. I can help you add and view Idols, record Events, and scan and organize Cheki after you select photos.
ja: こんにちは！Chekinanaです。アイドルの追加や表示、イベントの記録をお手伝いします。写真を選択すれば、チェキのスキャンや整理もできます。
zh_hans: 你好！我是 Chekinana。我可以帮你添加和查看偶像、记录活动，也可以在你选择照片后扫描和整理拍立得。
zh_hant: 你好！我是 Chekinana。我可以幫你新增和查看偶像、記錄活動，也可以在你選擇照片後掃描和整理拍立得。

source: Idol
ja: アイドル
zh_hans: 偶像
zh_hant: 偶像

source: idol lookup failed: HTTP %lld
ja: アイドル検索失敗：HTTP %lld
zh_hans: 偶像查询失败：HTTP %lld
zh_hant: 偶像查詢失敗：HTTP %lld

source: idol lookup failed: invalid API endpoint
ja: アイドル検索失敗：APIエンドポイントが無効です
zh_hans: 偶像查询失败：API 端点无效
zh_hant: 偶像查詢失敗：API 端點無效

source: idol lookup failed: invalid JSON response
ja: アイドル検索失敗：JSON応答が無効です
zh_hans: 偶像查询失败：JSON 响应无效
zh_hant: 偶像查詢失敗：JSON 回應無效

source: idol lookup network error: %@
ja: アイドル検索のネットワークエラー：%@
zh_hans: 偶像查询网络错误：%@
zh_hant: 偶像查詢網路錯誤：%@

source: Idol name
ja: アイドル名
zh_hans: 偶像名称
zh_hant: 偶像名稱

source: idol not found: %@
ja: アイドルが見つかりません：%@
zh_hans: 未找到偶像：%@
zh_hant: 未找到偶像：%@

source: Idol pattern mapping failed validation.
ja: アイドルとパターンの対応の検証に失敗しました。
zh_hans: 偶像模式映射验证失败。
zh_hant: 偶像模式的對應關係驗證失敗。

# idol.color.blue
source: Blue
ja: 青
zh_hans: 蓝色
zh_hant: 藍色

# idol.color.green
source: Green
ja: 緑
zh_hans: 绿色
zh_hant: 綠色

# idol.color.invalid
source: Color could not be recognized. Enter an RGB value (for example, #4CAF50).
ja: 色を認識できません。RGB値（例：#4CAF50）を入力してください。
zh_hans: 无法识别颜色，请输入 RGB 值（例如 #4CAF50）
zh_hant: 無法辨識顏色，請輸入 RGB 值（例如 #4CAF50）。

# idol.color.light_blue
source: Light Blue
ja: 水色
zh_hans: 水色
zh_hant: 水色

# idol.color.orange
source: Orange
ja: オレンジ
zh_hans: 橙色
zh_hant: 橙色

# idol.color.pink
source: Pink
ja: ピンク
zh_hans: 粉色
zh_hant: 粉紅色

# idol.color.purple
source: Purple
ja: 紫
zh_hans: 紫色
zh_hant: 紫色

# idol.color.red
source: Red
ja: 赤
zh_hans: 红色
zh_hant: 紅色

# idol.color.white
source: White
ja: 白
zh_hans: 白色
zh_hant: 白色

# idol.color.yellow
source: Yellow
ja: 黄
zh_hans: 黄色
zh_hant: 黃色

source: Idols
ja: アイドル
zh_hans: 偶像
zh_hant: 偶像

source: idx is assigned only after both idol and date exist
ja: idolとdateの両方が設定された後にのみidxが割り当てられます
zh_hans: 仅在 idol 和 date 都存在后分配 idx
zh_hant: 僅在 idol 和 date 都存在後分配 idx

source: If the Idol may be outside the selected range, enable Unassigned.
ja: アイドルが選択範囲外の可能性がある場合は、「未割り当て」を有効にしてください。
zh_hans: 如果偶像可能不在所选范围内，请启用“未分配”。
zh_hant: 如果偶像可能不在所選範圍內，請啟用「未分配」。

# import.action.continue
source: Continue to Records
ja: 記録の追加へ
zh_hans: 继续添加记录
zh_hant: 繼續新增記錄

# import.action.read
source: Open File Browser
ja: ファイルを選択
zh_hans: 打开文件浏览器
zh_hant: 開啟檔案瀏覽器

# import.action.records
source: Import %lld Records
ja: %lld件の記録をインポート
zh_hans: 导入%lld条记录
zh_hant: 匯入 %lld 筆記錄

# import.action.records.one
source: Import %lld Record
ja: %lld件の記録をインポート
zh_hans: 导入%lld条记录
zh_hant: 匯入 %lld 筆記錄

# import.action.records.other
source: Import %lld Records
ja: %lld件の記録をインポート
zh_hans: 导入%lld条记录
zh_hant: 匯入 %lld 筆記錄

# import.catalogue.ambiguous
source: More than one catalogue match was found.
ja: 一致する検索結果が複数あります。
zh_hans: 找到多个匹配结果，无法唯一确定。
zh_hant: 找到多個匹配結果，無法唯一確定。

# import.catalogue.fallback
source: %@ Using the backup profile.
ja: %@ バックアップの情報を使用します。
zh_hans: %@ 将使用备份中的资料。
zh_hant: %@ 將使用備份中的資料。

# import.catalogue.group_mismatch
source: The group does not match.
ja: グループが一致しません。
zh_hans: 组合不匹配。
zh_hant: 團體不匹配。

# import.catalogue.incomplete
source: Search results may be incomplete.
ja: 検索結果がすべて取得できていない可能性があります。
zh_hans: 搜索结果可能不完整，无法确认唯一匹配。
zh_hant: 搜尋結果可能不完整，無法確認唯一匹配。

# import.catalogue.invalid
source: The catalogue profile contains invalid data.
ja: 検索結果に無効なデータが含まれています。
zh_hans: 资料库结果包含无效资料。
zh_hant: 資料庫結果包含無效資料。

# import.catalogue.matched
source: Catalogue match: %1$@ · %2$@
ja: 検索結果：%1$@ · %2$@
zh_hans: 资料库匹配：%1$@ · %2$@
zh_hant: 資料庫匹配：%1$@ · %2$@

# import.catalogue.missing_group
source: Group is missing and cannot be verified.
ja: グループが未入力のため確認できません。
zh_hans: 组合为空，无法校验。
zh_hant: 團體為空，無法驗證。

# import.catalogue.not_found
source: No exact name match was found.
ja: 名前が完全に一致する結果がありません。
zh_hans: 未找到姓名完全匹配的结果。
zh_hant: 未找到姓名完全匹配的結果。

# import.catalogue.pending
source: Search the current name and group before continuing.
ja: 続行する前に現在の名前とグループで検索してください。
zh_hans: 姓名或组合尚未搜索，请先搜索再继续。
zh_hant: 姓名或團體尚未搜尋，請先搜尋再繼續。

# import.catalogue.search
source: Search current names
ja: 現在の名前で検索
zh_hans: 搜索当前姓名
zh_hant: 搜尋目前姓名

# import.catalogue.unavailable
source: The catalogue search failed.
ja: カタログ検索に失敗しました。
zh_hans: 资料库搜索失败。
zh_hant: 資料庫搜尋失敗。

# import.choose_match
source: Choose…
ja: 選択…
zh_hans: 请选择…
zh_hant: 請選擇…

# import.color
source: Color
ja: カラー
zh_hans: 颜色
zh_hant: 顏色

source: Import complete
ja: インポート完了
zh_hans: 导入完成
zh_hant: 匯入完成

# import.create_new
source: Create New
ja: 新規作成
zh_hans: 新建
zh_hant: 新增

# import.deselect_all
source: Deselect All
ja: すべて選択解除
zh_hans: 取消全选
zh_hant: 取消全選

# import.error.avatar
source: An imported avatar is not a safe image.
ja: インポートされたアバター画像は安全ではありません。
zh_hans: 导入的头像不是安全图像。
zh_hant: 匯入的頭像並非安全的影像。

# import.error.commit_in_progress
source: A record import is already in progress.
ja: レコードのインポートはすでに進行中です。
zh_hans: 记录导入已在进行中。
zh_hant: 已有記錄正在匯入。

# import.error.database
source: Invalid backup database.
ja: バックアップデータベースが無効です。
zh_hans: 备份数据库无效。
zh_hant: 備份資料庫無效。

# import.error.database_budget
source: Backup database reading was cancelled or exceeded its resource limit.
ja: バックアップデータベースの読み込みがキャンセルされたか、リソース上限を超えました。
zh_hans: 备份数据库读取已取消或超出资源限制。
zh_hant: 讀取備份資料庫已取消或超出資源限制。

# import.error.database_open
source: Cannot open backup database.
ja: バックアップデータベースを開けません。
zh_hans: 无法打开备份数据库。
zh_hant: 無法開啟備份資料庫。

# import.error.destination_idol
source: A mapped Idol is unavailable in this import context. No records were imported.
ja: 対応するアイドルを利用できません。記録はインポートされませんでした。
zh_hans: 映射的偶像在当前导入上下文中不可用，未导入记录。
zh_hant: 本次匯入無法使用對應的偶像，未匯入任何記錄。

# import.error.duplicate_group_id
source: Backup contains a duplicate group ID.
ja: バックアップに重複したグループIDがあります。
zh_hans: 备份中存在重复的组合 ID。
zh_hant: 備份中存在重複的團體 ID。

# import.error.duplicate_member_id
source: Backup contains a duplicate Idol ID.
ja: バックアップに重複したアイドルIDがあります。
zh_hans: 备份中存在重复的偶像 ID。
zh_hant: 備份中存在重複的偶像 ID。

# import.error.entries
source: Required backup entries are missing.
ja: 必要なバックアップ項目がありません。
zh_hans: 缺少必要的备份条目。
zh_hant: 缺少必要的備份項目。

# import.error.entry
source: Required backup entry missing.
ja: 必要なバックアップ項目がありません。
zh_hans: 缺少必要的备份条目。
zh_hant: 缺少必要的備份項目。

# import.error.file
source: Import file is too large or invalid.
ja: インポートファイルが大きすぎるか無効です。
zh_hans: 导入文件过大或无效。
zh_hant: 匯入檔案過大或無效。

# import.error.group_reference
source: An Idol references an unknown group.
ja: アイドルが不明なグループを参照しています。
zh_hans: 偶像引用了未知团体。
zh_hant: 偶像參照了未知的團體。

# import.error.groups
source: Too many groups.
ja: グループが多すぎます。
zh_hans: 团体数量过多。
zh_hant: 團體數量過多。

# import.error.idol_reference
source: A record references an unknown Idol.
ja: 記録が不明なアイドルを参照しています。
zh_hans: 记录引用了未知偶像。
zh_hant: 記錄參照了未知的偶像。
